In [1]:
import pandas as pd
import numpy as np
import re
from pathlib import Path

DATA_DIR = Path("../data")
OUT_DIR = Path("../outputs")
OUT_DIR.mkdir(exist_ok=True)
(OUT_DIR / "figures").mkdir(exist_ok=True)

In [2]:
def clean_number(x):
    """Convert '1,234.56' -> 1234.56. Return NaN if not numeric."""
    if pd.isna(x):
        return np.nan
    s = str(x).strip().replace(",", "")
    if s in ["", "None", "nan"]:
        return np.nan
    try:
        return float(s)
    except:
        return np.nan

def normalize_branch(name):
    """Standardize branch names for matching across files."""
    if pd.isna(name) or name is None:
        return None
    s = str(name).lower().strip()
    s = re.sub(r'[^a-z0-9\s]', ' ', s)   # remove punctuation
    s = re.sub(r'\s+', ' ', s).strip()  # collapse spaces
    return s

In [3]:
f4 = DATA_DIR / "rep_s_00673_SMRY.csv"
df4_raw = pd.read_csv(f4)
df4_raw.head(20)

,Stories,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,Theoretical Profit By Category,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,22-Jan-26,NaN,NaN,Years:2025 Month:0,NaN,NaN,NaN,Page 1 of,NaN,3.0
2,Category,Qty,Total Price,NaN,Total Cost,Total Cost %,Total Profit,NaN,Total Profit %,NaN
3,Stories - Bir Hasan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,BEVERAGES,"137,572.1","1,841,385.84",NaN,"4,143,855.17",22.50,"14,270,003.22",NaN,77.50,NaN
5,FOOD,"102,791.4","1,264,966.00",NaN,"4,658,225.80",36.82,"7,991,434.23",NaN,63.18,NaN
6,Total By Branch:,"240,363.5","3,106,351.84",NaN,"8,802,080.97",28.34,"22,261,437.45",NaN,71.66,NaN
7,Stories Centro Mall,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,BEVERAGES,"138,680.5","2,054,988.70",NaN,"4,591,734.79",22.34,"15,958,152.17",NaN,77.66,NaN
9,FOOD,"121,423.1","1,307,149.74",NaN,"4,981,860.70",38.11,"8,089,636.74",NaN,61.89,NaN
10,Total By Branch:,"260,103.6","3,362,138.44",NaN,"9,573,595.50",28.47,"24,047,788.90",NaN,71.53,NaN
11,Stories LAU,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,BEVERAGES,"58,430.00","777,228.30",NaN,"1,774,898.67",22.84,"5,997,384.33",NaN,77.16,NaN
13,FOOD,"73,384.15","767,489.57",NaN,"2,799,004.10",36.47,"4,875,891.58",NaN,63.53,NaN
14,Total By Branch:,"131,814.1","1,544,717.87",NaN,"4,573,902.77",29.61,"10,873,275.90",NaN,70.39,NaN
15,Stories Faqra,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16,BEVERAGES,"49,605.00","671,882.79",NaN,"1,426,297.24",21.23,"5,292,530.68",NaN,78.77,NaN
17,FOOD,"46,504.70","4,199,569.55",NaN,"1,508,720.49",35.93,"2,690,849.07",NaN,64.07,NaN
18,Total By Branch:,"96,109.70","1,091,839.75",NaN,"2,935,017.73",26.88,"7,983,379.74",NaN,73.12,NaN
19,Stories.,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
df4_raw.columns.tolist()

['Stories',
 'Unnamed: 1',
 'Unnamed: 2',
 'Unnamed: 3',
 'Unnamed: 4',
 'Unnamed: 5',
 'Unnamed: 6',
 'Unnamed: 7',
 'Unnamed: 8',
 'Unnamed: 9']

In [5]:
df4_raw.head(10)

,Stories,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,Theoretical Profit By Category,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,22-Jan-26,NaN,NaN,Years:2025 Month:0,NaN,NaN,NaN,Page 1 of,NaN,3.0
2,Category,Qty,Total Price,NaN,Total Cost,Total Cost %,Total Profit,NaN,Total Profit %,NaN
3,Stories - Bir Hasan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,BEVERAGES,"137,572.1","1,841,385.84",NaN,"4,143,855.17",22.50,"14,270,003.22",NaN,77.50,NaN
5,FOOD,"102,791.4","1,264,966.00",NaN,"4,658,225.80",36.82,"7,991,434.23",NaN,63.18,NaN
6,Total By Branch:,"240,363.5","3,106,351.84",NaN,"8,802,080.97",28.34,"22,261,437.45",NaN,71.66,NaN
7,Stories Centro Mall,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,BEVERAGES,"138,680.5","2,054,988.70",NaN,"4,591,734.79",22.34,"15,958,152.17",NaN,77.66,NaN
9,FOOD,"121,423.1","1,307,149.74",NaN,"4,981,860.70",38.11,"8,089,636.74",NaN,61.89,NaN

In [6]:
df4_raw = df4_raw.rename(columns={
    "Stories": "Category",
    "Unnamed: 1": "Qty",
    "Unnamed: 2": "Total Price",
    "Unnamed: 4": "Total Cost",
    "Unnamed: 5": "Total Cost %",
    "Unnamed: 6": "Total Profit",
    "Unnamed: 8": "Total Profit %"
})

In [7]:
df4 = df4_raw.copy()

# drop rows where Category is empty
df4 = df4[df4["Category"].notna()].copy()

# remove repeated export header rows
df4 = df4[~df4["Category"].astype(str).str.contains("Theoretical Profit", case=False, na=False)]
df4 = df4[~df4["Category"].astype(str).str.contains("Page", case=False, na=False)]
df4 = df4[df4["Category"].astype(str).str.strip() != "Category"]

df4.head(12)

,Category,Qty,Total Price,Unnamed: 3,Total Cost,Total Cost %,Total Profit,Unnamed: 7,Total Profit %,Unnamed: 9
1,22-Jan-26,NaN,NaN,Years:2025 Month:0,NaN,NaN,NaN,Page 1 of,NaN,3.0
3,Stories - Bir Hasan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,BEVERAGES,"137,572.1","1,841,385.84",NaN,"4,143,855.17",22.50,"14,270,003.22",NaN,77.50,NaN
5,FOOD,"102,791.4","1,264,966.00",NaN,"4,658,225.80",36.82,"7,991,434.23",NaN,63.18,NaN
6,Total By Branch:,"240,363.5","3,106,351.84",NaN,"8,802,080.97",28.34,"22,261,437.45",NaN,71.66,NaN
7,Stories Centro Mall,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,BEVERAGES,"138,680.5","2,054,988.70",NaN,"4,591,734.79",22.34,"15,958,152.17",NaN,77.66,NaN
9,FOOD,"121,423.1","1,307,149.74",NaN,"4,981,860.70",38.11,"8,089,636.74",NaN,61.89,NaN
10,Total By Branch:,"260,103.6","3,362,138.44",NaN,"9,573,595.50",28.47,"24,047,788.90",NaN,71.53,NaN
11,Stories LAU,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,BEVERAGES,"58,430.00","777,228.30",NaN,"1,774,898.67",22.84,"5,997,384.33",NaN,77.16,NaN
13,FOOD,"73,384.15","767,489.57",NaN,"2,799,004.10",36.47,"4,875,891.58",NaN,63.53,NaN

In [8]:
df4 = df4_raw.copy()

# keep only rows where Category is not empty
df4 = df4[df4["Category"].notna()].copy()

# remove export junk/header rows
df4 = df4[~df4["Category"].astype(str).str.contains("Theoretical Profit", case=False, na=False)]
df4 = df4[~df4["Category"].astype(str).str.contains("Page", case=False, na=False)]
df4 = df4[~df4["Category"].astype(str).str.match(r"\d{1,2}-[A-Za-z]{3}-\d{2}", na=False)]  # removes 22-Jan-26 style rows
df4 = df4[df4["Category"].astype(str).str.strip() != "Category"]  # removes the row that says Category Qty Total Price...

df4.head(15)

,Category,Qty,Total Price,Unnamed: 3,Total Cost,Total Cost %,Total Profit,Unnamed: 7,Total Profit %,Unnamed: 9
3,Stories - Bir Hasan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,BEVERAGES,"137,572.1","1,841,385.84",NaN,"4,143,855.17",22.50,"14,270,003.22",NaN,77.50,NaN
5,FOOD,"102,791.4","1,264,966.00",NaN,"4,658,225.80",36.82,"7,991,434.23",NaN,63.18,NaN
6,Total By Branch:,"240,363.5","3,106,351.84",NaN,"8,802,080.97",28.34,"22,261,437.45",NaN,71.66,NaN
7,Stories Centro Mall,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,BEVERAGES,"138,680.5","2,054,988.70",NaN,"4,591,734.79",22.34,"15,958,152.17",NaN,77.66,NaN
9,FOOD,"121,423.1","1,307,149.74",NaN,"4,981,860.70",38.11,"8,089,636.74",NaN,61.89,NaN
10,Total By Branch:,"260,103.6","3,362,138.44",NaN,"9,573,595.50",28.47,"24,047,788.90",NaN,71.53,NaN
11,Stories LAU,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,BEVERAGES,"58,430.00","777,228.30",NaN,"1,774,898.67",22.84,"5,997,384.33",NaN,77.16,NaN
13,FOOD,"73,384.15","767,489.57",NaN,"2,799,004.10",36.47,"4,875,891.58",NaN,63.53,NaN
14,Total By Branch:,"131,814.1","1,544,717.87",NaN,"4,573,902.77",29.61,"10,873,275.90",NaN,70.39,NaN
15,Stories Faqra,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16,BEVERAGES,"49,605.00","671,882.79",NaN,"1,426,297.24",21.23,"5,292,530.68",NaN,78.77,NaN
17,FOOD,"46,504.70","4,199,569.55",NaN,"1,508,720.49",35.93,"2,690,849.07",NaN,64.07,NaN

In [9]:
df4 = df4.reset_index(drop=True)

In [10]:
# rows that are branch headers start with "Stories"
is_branch_row = df4["Category"].astype(str).str.lower().str.startswith("stories")

# create a helper column that has branch name only on branch rows
df4["branch"] = df4["Category"].where(is_branch_row)

# forward-fill branch downwards
df4["branch"] = df4["branch"].ffill()

df4[["Category","branch"]].head(20)

               Category               branch
0   Stories - Bir Hasan  Stories - Bir Hasan
1             BEVERAGES  Stories - Bir Hasan
2                  FOOD  Stories - Bir Hasan
3      Total By Branch:  Stories - Bir Hasan
4   Stories Centro Mall  Stories Centro Mall
5             BEVERAGES  Stories Centro Mall
6                  FOOD  Stories Centro Mall
7      Total By Branch:  Stories Centro Mall
8           Stories LAU          Stories LAU
9             BEVERAGES          Stories LAU
10                 FOOD          Stories LAU
11     Total By Branch:          Stories LAU
12        Stories Faqra        Stories Faqra
13            BEVERAGES        Stories Faqra
14                 FOOD        Stories Faqra
15     Total By Branch:        Stories Faqra
16             Stories.             Stories.
17            BEVERAGES             Stories.
18                 FOOD             Stories.
19     Total By Branch:             Stories.

In [11]:
df4 = df4[df4["Category"].isin(["BEVERAGES","FOOD"])].copy()
df4.head(10)

,Category,Qty,Total Price,Unnamed: 3,Total Cost,Total Cost %,Total Profit,Unnamed: 7,Total Profit %,Unnamed: 9,branch
1,BEVERAGES,"137,572.1","1,841,385.84",NaN,"4,143,855.17",22.50,"14,270,003.22",NaN,77.50,NaN,Stories - Bir Hasan
2,FOOD,"102,791.4","1,264,966.00",NaN,"4,658,225.80",36.82,"7,991,434.23",NaN,63.18,NaN,Stories - Bir Hasan
5,BEVERAGES,"138,680.5","2,054,988.70",NaN,"4,591,734.79",22.34,"15,958,152.17",NaN,77.66,NaN,Stories Centro Mall
6,FOOD,"121,423.1","1,307,149.74",NaN,"4,981,860.70",38.11,"8,089,636.74",NaN,61.89,NaN,Stories Centro Mall
9,BEVERAGES,"58,430.00","777,228.30",NaN,"1,774,898.67",22.84,"5,997,384.33",NaN,77.16,NaN,Stories LAU
10,FOOD,"73,384.15","767,489.57",NaN,"2,799,004.10",36.47,"4,875,891.58",NaN,63.53,NaN,Stories LAU
13,BEVERAGES,"49,605.00","671,882.79",NaN,"1,426,297.24",21.23,"5,292,530.68",NaN,78.77,NaN,Stories Faqra
14,FOOD,"46,504.70","4,199,569.55",NaN,"1,508,720.49",35.93,"2,690,849.07",NaN,64.07,NaN,Stories Faqra
17,BEVERAGES,"55,306.50","782,327.67",NaN,"1,803,433.47",23.05,"6,019,843.20",NaN,76.95,NaN,Stories.
18,FOOD,"62,895.20","6,311,370.00",NaN,"2,473,263.04",39.19,"3,838,106.96",NaN,60.81,NaN,Stories.

In [12]:
for col in ["Qty", "Total Cost", "Total Profit"]:
    df4[col] = df4[col].apply(clean_number)

df4["Revenue"] = df4["Total Cost"] + df4["Total Profit"]
df4["Profit_Margin"] = df4["Total Profit"] / df4["Revenue"]
df4["branch_norm"] = df4["branch"].apply(normalize_branch)

df4[["branch","Category","Qty","Total Cost","Total Profit","Revenue","Profit_Margin"]].head(10)

,branch,Category,Qty,Total Cost,Total Profit,Revenue,Profit_Margin
1,Stories - Bir Hasan,BEVERAGES,137572.10,4143855.17,14270003.22,18413858.39,0.774960
2,Stories - Bir Hasan,FOOD,102791.40,4658225.80,7991434.23,12649660.03,0.631751
5,Stories Centro Mall,BEVERAGES,138680.50,4591734.79,15958152.17,20549886.96,0.776557
6,Stories Centro Mall,FOOD,121423.10,4981860.70,8089636.74,13071497.44,0.618876
9,Stories LAU,BEVERAGES,58430.00,1774898.67,5997384.33,7772283.00,0.771637
10,Stories LAU,FOOD,73384.15,2799004.10,4875891.58,7674895.68,0.635304
13,Stories Faqra,BEVERAGES,49605.00,1426297.24,5292530.68,6718827.92,0.787716
14,Stories Faqra,FOOD,46504.70,1508720.49,2690849.07,4199569.56,0.640744
17,Stories.,BEVERAGES,55306.50,1803433.47,6019843.20,7823276.67,0.769479
18,Stories.,FOOD,62895.20,2473263.04,3838106.96,6311370.00,0.608126

In [13]:
out4 = OUT_DIR / "clean_category_summary.csv"
df4.to_csv(out4, index=False)
print("Saved:", out4)

Saved: ..\outputs\clean_category_summary.csv

In [14]:
df4.shape, df4["branch"].nunique(), df4["Category"].value_counts()

((50, 14),
 25,
 Category
 BEVERAGES    25
 FOOD         25
 Name: count, dtype: int64)

In [15]:
from io import StringIO

f1 = DATA_DIR / "REP_S_00134_SMRY.csv"

with open(f1, "r", encoding="utf-8", errors="replace") as f:
    text1 = f.read()

df1_raw = pd.read_csv(StringIO(text1), header=None)
df1_raw.head(20)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,Stories,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Comparative Monthly Sales,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,22-Jan-2026,NaN,"Year: 2026,2025",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Page 1 of,0.01
3,NaN,NaN,NaN,January,February,March,April,May,June,July,August,September,NaN,NaN
4,2025,Stories - Bir Hasan,NaN,"3,355,705.33","2,842,993.67","2,266,050.67","3,459,979.67","2,125,379.33","744,638.33","3,799,740.25","3,783,897.91","3,255,935.75",NaN,NaN
5,NaN,Stories Ain El Mreisseh,NaN,"12,648,546.67","9,929,973.33","9,849,926.67","13,025,923.33","7,208,975.00","2,883,403.33","11,889,329.16","11,610,097.92","11,021,123.75",NaN,NaN
6,NaN,Stories Airport,NaN,0.00,0.00,0.00,0.00,0.00,"8,428.83","2,940,003.01","6,963,426.45","7,467,197.62",NaN,NaN
7,NaN,Stories Antelias,NaN,"2,615,854.33","2,139,010.67","3,162,716.67","3,391,741.33","2,033,635.67","728,978.33","2,963,696.71","3,182,363.97","2,909,965.47",NaN,NaN
8,NaN,Stories Batroun,NaN,"4,266,517.33","3,388,117.33","4,890,198.33","5,516,881.67","2,963,980.33","1,311,240.00","6,135,003.02","6,751,770.29","5,041,150.76",NaN,NaN
9,NaN,Stories Bayada,NaN,"4,497,376.67","3,419,106.67","5,083,386.67","5,196,906.67","3,043,400.00","1,208,190.00","5,448,609.92","5,613,038.75","4,917,258.26",NaN,NaN
10,NaN,Stories Centro Mall,NaN,"3,264,533.33","2,944,806.67","2,218,466.67","3,937,166.67","1,955,286.67","924,383.33","4,201,339.95","4,307,333.34","3,232,537.55",NaN,NaN
11,NaN,Stories Event Starco,NaN,0.00,0.00,0.00,0.00,0.00,0.00,918.92,"3,141.14",0.00,NaN,NaN
12,NaN,Stories Faqra,NaN,"1,889,910.00","1,829,960.00","1,479,756.67","2,298,003.33","1,109,666.67","352,083.33","482,036.04","1,535,977.47",0.00,NaN,NaN
13,NaN,Stories Khaldeh,NaN,"7,468,155.33","6,108,429.33","6,420,841.00","8,455,732.00","4,487,117.67","2,262,395.00","9,464,291.92","10,661,995.53","7,859,844.17",NaN,NaN
14,NaN,Stories LAU,NaN,"1,832,006.33","1,863,050.33","1,859,610.67","2,358,631.33","1,206,958.00","398,961.67","1,050,186.19","1,683,288.29","627,849.85",NaN,NaN
15,NaN,Stories Le Mall,NaN,"3,881,015.00","3,772,586.67","4,220,770.00","4,428,620.00","2,163,876.67","967,783.33","4,986,426.44","5,452,825.84","4,201,888.90",NaN,NaN
16,NaN,NaN,January,February,March,April,May,June,July,August,September,NaN,NaN,NaN
17,2025,Stories Mansourieh,0.00,0.00,0.00,0.00,0.00,0.00,"193,405.41","5,928,212.63","5,813,335.75",NaN,NaN,NaN
18,NaN,Stories Ramlet El Bayda,0.00,"1,570,806.67","3,588,563.33","6,011,885.00","3,542,743.33","1,445,760.00","7,427,539.62","7,668,109.92","6,585,103.32",NaN,NaN,NaN
19,NaN,Stories Saida,"7,263,332.33","5,121,351.33","4,684,910.67","6,361,154.33","3,010,781.67","1,323,360.00","5,939,826.44","5,925,560.98","4,245,091.90",NaN,NaN,NaN

In [16]:
df1_raw.shape

(112, 14)

In [17]:
for c in range(min(10, df1_raw.shape[1])):
    sample = df1_raw[c].astype(str)
    if sample.str.contains("Stories", na=False).any():
        print("Found 'Stories' in column:", c)

Found 'Stories' in column: 0
Found 'Stories' in column: 1

In [18]:
BRANCH_COL = 1
YEAR_COL = 0

In [19]:
BRANCH_COL = 1
YEAR_COL = 0

In [20]:
df1_raw.columns = [f"c{i}" for i in range(df1_raw.shape[1])]

mask_branch = df1_raw[f"c{BRANCH_COL}"].astype(str).str.contains("Stories", na=False)
df1 = df1_raw[mask_branch].copy()

df1.head(10)

,c0,c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11,c12,c13
4,2025,Stories - Bir Hasan,NaN,"3,355,705.33","2,842,993.67","2,266,050.67","3,459,979.67","2,125,379.33","744,638.33","3,799,740.25","3,783,897.91","3,255,935.75",NaN,NaN
5,NaN,Stories Ain El Mreisseh,NaN,"12,648,546.67","9,929,973.33","9,849,926.67","13,025,923.33","7,208,975.00","2,883,403.33","11,889,329.16","11,610,097.92","11,021,123.75",NaN,NaN
6,NaN,Stories Airport,NaN,0.00,0.00,0.00,0.00,0.00,"8,428.83","2,940,003.01","6,963,426.45","7,467,197.62",NaN,NaN
7,NaN,Stories Antelias,NaN,"2,615,854.33","2,139,010.67","3,162,716.67","3,391,741.33","2,033,635.67","728,978.33","2,963,696.71","3,182,363.97","2,909,965.47",NaN,NaN
8,NaN,Stories Batroun,NaN,"4,266,517.33","3,388,117.33","4,890,198.33","5,516,881.67","2,963,980.33","1,311,240.00","6,135,003.02","6,751,770.29","5,041,150.76",NaN,NaN
9,NaN,Stories Bayada,NaN,"4,497,376.67","3,419,106.67","5,083,386.67","5,196,906.67","3,043,400.00","1,208,190.00","5,448,609.92","5,613,038.75","4,917,258.26",NaN,NaN
10,NaN,Stories Centro Mall,NaN,"3,264,533.33","2,944,806.67","2,218,466.67","3,937,166.67","1,955,286.67","924,383.33","4,201,339.95","4,307,333.34","3,232,537.55",NaN,NaN
11,NaN,Stories Event Starco,NaN,0.00,0.00,0.00,0.00,0.00,0.00,918.92,"3,141.14",0.00,NaN,NaN
12,NaN,Stories Faqra,NaN,"1,889,910.00","1,829,960.00","1,479,756.67","2,298,003.33","1,109,666.67","352,083.33","482,036.04","1,535,977.47",0.00,NaN,NaN
13,NaN,Stories Khaldeh,NaN,"7,468,155.33","6,108,429.33","6,420,841.00","8,455,732.00","4,487,117.67","2,262,395.00","9,464,291.92","10,661,995.53","7,859,844.17",NaN,NaN

In [21]:
df1["year"] = df1[f"c{YEAR_COL}"].replace("", np.nan).ffill()
df1["year"] = df1["year"].apply(clean_number).astype("Int64")

df1[["year", f"c{BRANCH_COL}"]].head(15)

    year                       c1
4   2025      Stories - Bir Hasan
5   2025  Stories Ain El Mreisseh
6   2025          Stories Airport
7   2025         Stories Antelias
8   2025          Stories Batroun
9   2025           Stories Bayada
10  2025      Stories Centro Mall
11  2025     Stories Event Starco
12  2025            Stories Faqra
13  2025          Stories Khaldeh
14  2025              Stories LAU
15  2025          Stories Le Mall
17  2025       Stories Mansourieh
18  2025  Stories Ramlet El Bayda
19  2025            Stories Saida

In [22]:
import numpy as np
import pandas as pd

# make sure df1 exists and has year + c1 already
df1 = df1.reset_index(drop=True)

months = ["jan","feb","mar","apr","may","jun","jul","aug","sep","oct","nov","dec"]

# Convert everything to numeric where possible (fast)
num_df = df1.apply(lambda col: pd.to_numeric(col.astype(str).str.replace(",", ""), errors="coerce"))

# Extract first 12 numeric values per row
vals = num_df.to_numpy()
out = np.full((vals.shape[0], 12), np.nan)

for i in range(vals.shape[0]):
    rownums = vals[i][~np.isnan(vals[i])]
    # remove year if it appears inside the numeric list
    rownums = rownums[~np.isin(rownums, [2025, 2026])]
    out[i, :min(12, len(rownums))] = rownums[:12]

month_vals = pd.DataFrame(out, columns=months)

df1_fast = pd.concat([df1, month_vals], axis=1)

# quick view
df1_fast[["year", "c1", "jan", "feb", "mar"]].head(10)

   year                       c1          jan         feb         mar
0  2025      Stories - Bir Hasan   3355705.33  2842993.67  2266050.67
1  2025  Stories Ain El Mreisseh  12648546.67  9929973.33  9849926.67
2  2025          Stories Airport         0.00        0.00        0.00
3  2025         Stories Antelias   2615854.33  2139010.67  3162716.67
4  2025          Stories Batroun   4266517.33  3388117.33  4890198.33
5  2025           Stories Bayada   4497376.67  3419106.67  5083386.67
6  2025      Stories Centro Mall   3264533.33  2944806.67  2218466.67
7  2025     Stories Event Starco         0.00        0.00        0.00
8  2025            Stories Faqra   1889910.00  1829960.00  1479756.67
9  2025          Stories Khaldeh   7468155.33  6108429.33  6420841.00

In [23]:
import pandas as pd
import numpy as np
from pathlib import Path

In [24]:
import pandas as pd
import numpy as np
from pathlib import Path

In [25]:
import os
os.getcwd()

'C:\\projects\\stories-coffee-analytics\\notebooks'

In [26]:
df1_raw = pd.read_csv("../data/REP_S_00134_SMRY.csv", header=None)

In [27]:
df1_raw = pd.read_csv(r"C:\projects\stories-coffee-analytics\data\REP_S_00134_SMRY.csv", header=None)

In [28]:
df1_raw.shape

(112, 14)

In [29]:
os.getcwd()

'C:\\projects\\stories-coffee-analytics\\notebooks'

In [30]:
df1 = df1_raw.copy()

In [31]:
df1 = df1.apply(lambda col: col.map(clean_number))

In [32]:
import re
import numpy as np

def clean_number(x):
    if x is None:
        return np.nan
    if isinstance(x, (int, float)):
        return x
    x = str(x).strip()
    if x == "" or x.lower() in ["nan", "none"]:
        return np.nan

    # remove commas and any non-numeric characters (except . and -)
    x = re.sub(r"[^\d\.\-]", "", x)

    try:
        return float(x)
    except:
        return np.nan

In [33]:
df1 = df1.apply(lambda col: col.map(clean_number))

In [34]:
df1.head()
df1.dtypes

0     float64
1     float64
2     float64
3     float64
4     float64
5     float64
6     float64
7     float64
8     float64
9     float64
10    float64
11    float64
12    float64
13    float64
dtype: object

In [35]:
df1_raw.head(10)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,Stories,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Comparative Monthly Sales,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,22-Jan-2026,NaN,"Year: 2026,2025",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Page 1 of,0.01
3,NaN,NaN,NaN,January,February,March,April,May,June,July,August,September,NaN,NaN
4,2025,Stories - Bir Hasan,NaN,"3,355,705.33","2,842,993.67","2,266,050.67","3,459,979.67","2,125,379.33","744,638.33","3,799,740.25","3,783,897.91","3,255,935.75",NaN,NaN
5,NaN,Stories Ain El Mreisseh,NaN,"12,648,546.67","9,929,973.33","9,849,926.67","13,025,923.33","7,208,975.00","2,883,403.33","11,889,329.16","11,610,097.92","11,021,123.75",NaN,NaN
6,NaN,Stories Airport,NaN,0.00,0.00,0.00,0.00,0.00,"8,428.83","2,940,003.01","6,963,426.45","7,467,197.62",NaN,NaN
7,NaN,Stories Antelias,NaN,"2,615,854.33","2,139,010.67","3,162,716.67","3,391,741.33","2,033,635.67","728,978.33","2,963,696.71","3,182,363.97","2,909,965.47",NaN,NaN
8,NaN,Stories Batroun,NaN,"4,266,517.33","3,388,117.33","4,890,198.33","5,516,881.67","2,963,980.33","1,311,240.00","6,135,003.02","6,751,770.29","5,041,150.76",NaN,NaN
9,NaN,Stories Bayada,NaN,"4,497,376.67","3,419,106.67","5,083,386.67","5,196,906.67","3,043,400.00","1,208,190.00","5,448,609.92","5,613,038.75","4,917,258.26",NaN,NaN

In [36]:
import os
from pathlib import Path
print("CWD:", os.getcwd())
print("Repo root exists:", Path("..").resolve())
print("Data files:", list(Path("..").glob("data/*.csv"))[:10])

CWD: C:\projects\stories-coffee-analytics\notebooks
Repo root exists: C:\projects\stories-coffee-analytics
Data files: [WindowsPath('../data/rep_s_00014_SMRY.csv'), WindowsPath('../data/REP_S_00134_SMRY.csv'), WindowsPath('../data/rep_s_00191_SMRY-3.csv'), WindowsPath('../data/rep_s_00673_SMRY.csv')]

In [37]:
import pandas as pd
import numpy as np

df1_raw = pd.read_csv("../data/REP_S_00134_SMRY.csv", header=None)
df1_raw.shape, df1_raw.head(12)

((112, 14),
                             0                        1                2   \
 0                      Stories                      NaN              NaN
 1   Comparative Monthly Sales                       NaN              NaN
 2                  22-Jan-2026                      NaN  Year: 2026,2025
 3                          NaN                      NaN              NaN
 4                         2025      Stories - Bir Hasan              NaN
 5                          NaN  Stories Ain El Mreisseh              NaN
 6                          NaN          Stories Airport              NaN
 7                          NaN         Stories Antelias              NaN
 8                          NaN          Stories Batroun              NaN
 9                          NaN           Stories Bayada              NaN
 10                         NaN      Stories Centro Mall              NaN
 11                         NaN     Stories Event Starco              NaN

                3             4             5              6             7   \
 0             NaN           NaN           NaN            NaN           NaN
 1             NaN           NaN           NaN            NaN           NaN
 2             NaN           NaN           NaN            NaN           NaN
 3         January      February         March          April           May
 4    3,355,705.33  2,842,993.67  2,266,050.67   3,459,979.67  2,125,379.33
 5   12,648,546.67  9,929,973.33  9,849,926.67  13,025,923.33  7,208,975.00
 6            0.00          0.00          0.00           0.00          0.00
 7    2,615,854.33  2,139,010.67  3,162,716.67   3,391,741.33  2,033,635.67
 8    4,266,517.33  3,388,117.33  4,890,198.33   5,516,881.67  2,963,980.33
 9    4,497,376.67  3,419,106.67  5,083,386.67   5,196,906.67  3,043,400.00
 10   3,264,533.33  2,944,806.67  2,218,466.67   3,937,166.67  1,955,286.67
 11           0.00          0.00          0.00           0.00          0.00

               8              9              10             11         12    13
 0            NaN            NaN            NaN            NaN        NaN   NaN
 1            NaN            NaN            NaN            NaN        NaN   NaN
 2            NaN            NaN            NaN            NaN  Page 1 of  0.01
 3           June           July         August      September        NaN   NaN
 4     744,638.33   3,799,740.25   3,783,897.91   3,255,935.75        NaN   NaN
 5   2,883,403.33  11,889,329.16  11,610,097.92  11,021,123.75        NaN   NaN
 6       8,428.83   2,940,003.01   6,963,426.45   7,467,197.62        NaN   NaN
 7     728,978.33   2,963,696.71   3,182,363.97   2,909,965.47        NaN   NaN
 8   1,311,240.00   6,135,003.02   6,751,770.29   5,041,150.76        NaN   NaN
 9   1,208,190.00   5,448,609.92   5,613,038.75   4,917,258.26        NaN   NaN
 10    924,383.33   4,201,339.95   4,307,333.34   3,232,537.55        NaN   NaN
 11          0.00         918.92       3,141.14           0.00        NaN   NaN  )

In [38]:
YEAR_COL = 0
BRANCH_COL = 1
MONTH_START_COL = 3   # January
MONTH_END_COL = 14    # exclusive end (we'll slice 3:15 for 12 months)

In [39]:
# Find the first row where YEAR_COL looks like 2025/2026 etc
year_numeric = pd.to_numeric(df1_raw[YEAR_COL], errors="coerce")
start_idx = year_numeric.first_valid_index()
start_idx

4

In [40]:
df = df1_raw.loc[start_idx:].copy()
df.head(5)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
4,2025,Stories - Bir Hasan,NaN,"3,355,705.33","2,842,993.67","2,266,050.67","3,459,979.67","2,125,379.33","744,638.33","3,799,740.25","3,783,897.91","3,255,935.75",NaN,NaN
5,NaN,Stories Ain El Mreisseh,NaN,"12,648,546.67","9,929,973.33","9,849,926.67","13,025,923.33","7,208,975.00","2,883,403.33","11,889,329.16","11,610,097.92","11,021,123.75",NaN,NaN
6,NaN,Stories Airport,NaN,0.00,0.00,0.00,0.00,0.00,"8,428.83","2,940,003.01","6,963,426.45","7,467,197.62",NaN,NaN
7,NaN,Stories Antelias,NaN,"2,615,854.33","2,139,010.67","3,162,716.67","3,391,741.33","2,033,635.67","728,978.33","2,963,696.71","3,182,363.97","2,909,965.47",NaN,NaN
8,NaN,Stories Batroun,NaN,"4,266,517.33","3,388,117.33","4,890,198.33","5,516,881.67","2,963,980.33","1,311,240.00","6,135,003.02","6,751,770.29","5,041,150.76",NaN,NaN

In [41]:
df["year"] = pd.to_numeric(df[YEAR_COL], errors="coerce").ffill().astype("Int64")
df["branch"] = df[BRANCH_COL].where(
    df[BRANCH_COL].astype(str).str.lower().str.startswith("stories"),
    np.nan
).ffill()

df[["year","branch"]].head(10)

    year                   branch
4   2025      Stories - Bir Hasan
5   2025  Stories Ain El Mreisseh
6   2025          Stories Airport
7   2025         Stories Antelias
8   2025          Stories Batroun
9   2025           Stories Bayada
10  2025      Stories Centro Mall
11  2025     Stories Event Starco
12  2025            Stories Faqra
13  2025          Stories Khaldeh

In [42]:
month_block = df.loc[:, MONTH_START_COL:MONTH_END_COL-1].copy()

# remove commas and convert
month_block = month_block.replace({",": ""}, regex=True)
month_block = month_block.apply(pd.to_numeric, errors="coerce")

month_block.head(5), month_block.dtypes

(             3           4           5            6           7           8  \
 4   3355705.33  2842993.67  2266050.67   3459979.67  2125379.33   744638.33
 5  12648546.67  9929973.33  9849926.67  13025923.33  7208975.00  2883403.33
 6         0.00        0.00        0.00         0.00        0.00     8428.83
 7   2615854.33  2139010.67  3162716.67   3391741.33  2033635.67   728978.33
 8   4266517.33  3388117.33  4890198.33   5516881.67  2963980.33  1311240.00

              9           10           11  12  13
 4   3799740.25   3783897.91   3255935.75 NaN NaN
 5  11889329.16  11610097.92  11021123.75 NaN NaN
 6   2940003.01   6963426.45   7467197.62 NaN NaN
 7   2963696.71   3182363.97   2909965.47 NaN NaN
 8   6135003.02   6751770.29   5041150.76 NaN NaN  ,
 3     float64
 4     float64
 5     float64
 6     float64
 7     float64
 8     float64
 9     float64
 10    float64
 11    float64
 12    float64
 13    float64
 dtype: object)

In [43]:
month_block = df1.loc[4:, 3:14].copy()
month_block.head()

,3,4,5,6,7,8,9,10,11,12,13
4,3355705.33,2842993.67,2266050.67,3459979.67,2125379.33,744638.33,3799740.25,3783897.91,3255935.75,NaN,NaN
5,12648546.67,9929973.33,9849926.67,13025923.33,7208975.00,2883403.33,11889329.16,11610097.92,11021123.75,NaN,NaN
6,0.00,0.00,0.00,0.00,0.00,8428.83,2940003.01,6963426.45,7467197.62,NaN,NaN
7,2615854.33,2139010.67,3162716.67,3391741.33,2033635.67,728978.33,2963696.71,3182363.97,2909965.47,NaN,NaN
8,4266517.33,3388117.33,4890198.33,5516881.67,2963980.33,1311240.00,6135003.02,6751770.29,5041150.76,NaN,NaN

In [44]:
month_block.shape

(108, 11)

In [45]:
months = ["jan","feb","mar","apr","may","jun","jul","aug","sep","oct","nov","dec"]

# take the raw month area (from col 3 onward), row 4 onward (your data rows)
raw_month_area = df1.loc[4:, 3:].copy()

def first_12_numbers(row):
    vals = []
    for x in row.values:
        if pd.notna(x):
            vals.append(float(x))
    # pad / trim to exactly 12
    vals = (vals + [np.nan]*12)[:12]
    return pd.Series(vals, index=months)

month_block = raw_month_area.apply(first_12_numbers, axis=1)
month_block.shape, month_block.head()

((108, 12),
            jan         feb         mar          apr         may         jun  \
 4   3355705.33  2842993.67  2266050.67   3459979.67  2125379.33   744638.33
 5  12648546.67  9929973.33  9849926.67  13025923.33  7208975.00  2883403.33
 6         0.00        0.00        0.00         0.00        0.00     8428.83
 7   2615854.33  2139010.67  3162716.67   3391741.33  2033635.67   728978.33
 8   4266517.33  3388117.33  4890198.33   5516881.67  2963980.33  1311240.00

            jul          aug          sep  oct  nov  dec
 4   3799740.25   3783897.91   3255935.75  NaN  NaN  NaN
 5  11889329.16  11610097.92  11021123.75  NaN  NaN  NaN
 6   2940003.01   6963426.45   7467197.62  NaN  NaN  NaN
 7   2963696.71   3182363.97   2909965.47  NaN  NaN  NaN
 8   6135003.02   6751770.29   5041150.76  NaN  NaN  NaN  )

In [46]:
month_block.shape

(108, 12)

In [47]:
df = df1.copy()

df["year"] = df[0].ffill()
df["branch"] = df[1].ffill()

# keep only real data rows (where we actually have a branch name)
df_data = df.loc[4:].copy()
df_data = df_data[df_data["branch"].astype(str).str.lower().str.startswith("stories")]
df_data[["year","branch"]].head(10)

Empty DataFrame
Columns: [year, branch]
Index: []

In [48]:
df = df1.copy()
df["year"] = df[0].ffill()
df["branch"] = df[1].ffill()

df.loc[0:25, [0, 1, "year", "branch"]]

         0   1    year  branch
0      NaN NaN     NaN     NaN
1      NaN NaN     NaN     NaN
2      NaN NaN     NaN     NaN
3      NaN NaN     NaN     NaN
4   2025.0 NaN  2025.0     NaN
5      NaN NaN  2025.0     NaN
6      NaN NaN  2025.0     NaN
7      NaN NaN  2025.0     NaN
8      NaN NaN  2025.0     NaN
9      NaN NaN  2025.0     NaN
10     NaN NaN  2025.0     NaN
11     NaN NaN  2025.0     NaN
12     NaN NaN  2025.0     NaN
13     NaN NaN  2025.0     NaN
14     NaN NaN  2025.0     NaN
15     NaN NaN  2025.0     NaN
16     NaN NaN  2025.0     NaN
17  2025.0 NaN  2025.0     NaN
18     NaN NaN  2025.0     NaN
19     NaN NaN  2025.0     NaN
20     NaN NaN  2025.0     NaN
21     NaN NaN  2025.0     NaN
22     NaN NaN  2025.0     NaN
23     NaN NaN  2025.0     NaN
24     NaN NaN  2025.0     NaN
25     NaN NaN  2025.0     NaN

In [49]:
import pandas as pd, numpy as np

# start from raw again (NOT the cleaned df1 that changed types)
df1_raw = pd.read_csv(r"C:\projects\stories-coffee-analytics\data\REP_S_00134_SMRY.csv", header=None)

df = df1_raw.copy()

# year is in col 0, branch name is in col 1 (based on your table)
df["year_raw"] = df[0]
df["branch_raw"] = df[1]

df.loc[0:25, [0, 1, "year_raw", "branch_raw"]]

,0,1,year_raw,branch_raw
0,Stories,NaN,Stories,NaN
1,Comparative Monthly Sales,NaN,Comparative Monthly Sales,NaN
2,22-Jan-2026,NaN,22-Jan-2026,NaN
3,NaN,NaN,NaN,NaN
4,2025,Stories - Bir Hasan,2025,Stories - Bir Hasan
5,NaN,Stories Ain El Mreisseh,NaN,Stories Ain El Mreisseh
6,NaN,Stories Airport,NaN,Stories Airport
7,NaN,Stories Antelias,NaN,Stories Antelias
8,NaN,Stories Batroun,NaN,Stories Batroun
9,NaN,Stories Bayada,NaN,Stories Bayada
10,NaN,Stories Centro Mall,NaN,Stories Centro Mall
11,NaN,Stories Event Starco,NaN,Stories Event Starco
12,NaN,Stories Faqra,NaN,Stories Faqra
13,NaN,Stories Khaldeh,NaN,Stories Khaldeh
14,NaN,Stories LAU,NaN,Stories LAU
15,NaN,Stories Le Mall,NaN,Stories Le Mall
16,NaN,NaN,NaN,NaN
17,2025,Stories Mansourieh,2025,Stories Mansourieh
18,NaN,Stories Ramlet El Bayda,NaN,Stories Ramlet El Bayda
19,NaN,Stories Saida,NaN,Stories Saida
20,NaN,Stories Sour 2,NaN,Stories Sour 2
21,NaN,Stories Verdun,NaN,Stories Verdun
22,NaN,Stories Zalka,NaN,Stories Zalka
23,NaN,Stories alay,NaN,Stories alay
24,NaN,Stories amioun,NaN,Stories amioun
25,NaN,Stories jbeil,NaN,Stories jbeil

In [50]:
df["year"] = pd.to_numeric(df["year_raw"], errors="coerce").ffill()
df["branch"] = df["branch_raw"].astype(str)

# keep only rows where branch starts with "Stories"
mask = df["branch"].str.lower().str.startswith("stories")
df_data = df.loc[mask].copy()

df_data[["year", "branch"]].head(10)

      year                   branch
4   2025.0      Stories - Bir Hasan
5   2025.0  Stories Ain El Mreisseh
6   2025.0          Stories Airport
7   2025.0         Stories Antelias
8   2025.0          Stories Batroun
9   2025.0           Stories Bayada
10  2025.0      Stories Centro Mall
11  2025.0     Stories Event Starco
12  2025.0            Stories Faqra
13  2025.0          Stories Khaldeh

In [51]:
# find the header row that contains "January"
header_row = df1_raw.apply(lambda r: r.astype(str).str.contains("January", case=False, na=False).any(), axis=1)
header_idx = header_row[header_row].index[0]
header_idx

np.int64(3)

In [52]:
df1_raw.loc[header_idx]

0           NaN
1           NaN
2           NaN
3       January
4      February
5         March
6         April
7           May
8          June
9          July
10       August
11    September
12          NaN
13          NaN
Name: 3, dtype: object

In [53]:
df_data = df_data[df_data["branch"].astype(str).str.lower().str.startswith("stories")]

In [54]:
df = df1.copy()
df["year"] = df[0].ffill()
df["branch"] = df[1].ffill()

df_tmp = df.loc[4:, ["year","branch"]].reset_index(drop=True)
df_tmp.head(30)

      year  branch
0   2025.0     NaN
1   2025.0     NaN
2   2025.0     NaN
3   2025.0     NaN
4   2025.0     NaN
5   2025.0     NaN
6   2025.0     NaN
7   2025.0     NaN
8   2025.0     NaN
9   2025.0     NaN
10  2025.0     NaN
11  2025.0     NaN
12  2025.0     NaN
13  2025.0     NaN
14  2025.0     NaN
15  2025.0     NaN
16  2025.0     NaN
17  2025.0     NaN
18  2025.0     NaN
19  2025.0     NaN
20  2025.0     NaN
21  2025.0     NaN
22  2025.0     NaN
23  2025.0     NaN
24  2025.0     NaN
25  2025.0     NaN
26  2025.0     NaN
27  2025.0     NaN
28  2026.0     NaN
29  2026.0     NaN

In [55]:
df_tmp["branch_str"] = df_tmp["branch"].astype(str).str.lower()
df_tmp["has_stories"] = df_tmp["branch_str"].str.contains("stories", na=False)

df_tmp["has_stories"].value_counts(), df_tmp[df_tmp["has_stories"]].head(10)

(has_stories
 False    108
 Name: count, dtype: int64,
 Empty DataFrame
 Columns: [year, branch, branch_str, has_stories]
 Index: [])

In [56]:
df_data = df.loc[4:].reset_index(drop=True).copy()

# normalize branch text
b = df_data["branch"].astype(str).str.lower().str.replace(r"\s+", " ", regex=True).str.strip()

df_data = df_data[b.str.contains(r"\bstories\b", na=False)].reset_index(drop=True)
df_data[["year","branch"]].head(10), df_data.shape

(Empty DataFrame
 Columns: [year, branch]
 Index: [],
 (0, 16))

In [57]:
import pandas as pd
import numpy as np

# 1) Reload raw (IMPORTANT: start from df1_raw, not df1 that got numeric-cleaned)
df1_raw = pd.read_csv(r"..\data\REP_S_00134_SMRY.csv", header=None)

# 2) Find the header row that contains "January"
header_row = df1_raw.apply(lambda r: r.astype(str).str.contains("January", case=False, na=False).any(), axis=1)
header_idx = header_row[header_row].index[0]   # you already saw it's 3

# 3) Keep only rows AFTER header row
raw = df1_raw.loc[header_idx+1:].reset_index(drop=True).copy()

# 4) Build year + branch from ORIGINAL text columns (0 and 1)
raw["year"] = pd.to_numeric(raw[0], errors="coerce").ffill()
raw["branch"] = raw[1].astype(str).replace("nan", np.nan).ffill()

# 5) Month columns are 3..11 in your mapping (Jan..Sep)
month_map = {'jan':3,'feb':4,'mar':5,'apr':6,'may':7,'jun':8,'jul':9,'aug':10,'sep':11}
months = list(month_map.keys())

def clean_number(x):
    if pd.isna(x): 
        return np.nan
    s = str(x).strip().replace(",", "")
    try:
        return float(s)
    except:
        return np.nan

for m, col in month_map.items():
    raw[m] = raw[col].map(clean_number)

# 6) Keep only real branch rows
clean_monthly = raw[raw["branch"].astype(str).str.lower().str.contains("stories", na=False)].copy()

# 7) Total + preview
clean_monthly["total_calc"] = clean_monthly[months].sum(axis=1, skipna=True)

clean_monthly[["year","branch"] + months + ["total_calc"]].head(10), clean_monthly.shape

(     year                   branch          jan         feb         mar  \
 0  2025.0      Stories - Bir Hasan   3355705.33  2842993.67  2266050.67
 1  2025.0  Stories Ain El Mreisseh  12648546.67  9929973.33  9849926.67
 2  2025.0          Stories Airport         0.00        0.00        0.00
 3  2025.0         Stories Antelias   2615854.33  2139010.67  3162716.67
 4  2025.0          Stories Batroun   4266517.33  3388117.33  4890198.33
 5  2025.0           Stories Bayada   4497376.67  3419106.67  5083386.67
 6  2025.0      Stories Centro Mall   3264533.33  2944806.67  2218466.67
 7  2025.0     Stories Event Starco         0.00        0.00        0.00
 8  2025.0            Stories Faqra   1889910.00  1829960.00  1479756.67
 9  2025.0          Stories Khaldeh   7468155.33  6108429.33  6420841.00

            apr         may         jun          jul          aug          sep  \
 0   3459979.67  2125379.33   744638.33   3799740.25   3783897.91   3255935.75
 1  13025923.33  7208975.00  2883403.33  11889329.16  11610097.92  11021123.75
 2         0.00        0.00     8428.83   2940003.01   6963426.45   7467197.62
 3   3391741.33  2033635.67   728978.33   2963696.71   3182363.97   2909965.47
 4   5516881.67  2963980.33  1311240.00   6135003.02   6751770.29   5041150.76
 5   5196906.67  3043400.00  1208190.00   5448609.92   5613038.75   4917258.26
 6   3937166.67  1955286.67   924383.33   4201339.95   4307333.34   3232537.55
 7         0.00        0.00        0.00       918.92      3141.14         0.00
 8   2298003.33  1109666.67   352083.33    482036.04   1535977.47         0.00
 9   8455732.00  4487117.67  2262395.00   9464291.92  10661995.53   7859844.17

     total_calc
 0  25634320.91
 1  90067299.16
 2  17379055.91
 3  23127963.15
 4  40264859.06
 5  38427273.61
 6  26985854.18
 7      4060.06
 8  10977393.51
 9  63188801.95  ,
 (102, 26))

In [58]:
months = ["jan","feb","mar","apr","may","jun","jul","aug","sep","oct","nov","dec"]

# add missing months if not present
for m in ["oct","nov","dec"]:
    if m not in clean_monthly.columns:
        clean_monthly[m] = np.nan

# make year an integer type (nullable)
clean_monthly["year"] = pd.to_numeric(clean_monthly["year"], errors="coerce").astype("Int64")

# make sure month columns are numeric
for m in months:
    clean_monthly[m] = pd.to_numeric(clean_monthly[m], errors="coerce")

# recompute total (safe)
clean_monthly["total_calc"] = clean_monthly[months].sum(axis=1, skipna=True)

clean_monthly.head()

,0,1,2,3,4,5,6,7,8,9,...,apr,may,jun,jul,aug,sep,total_calc,oct,nov,dec
0,2025,Stories - Bir Hasan,NaN,"3,355,705.33","2,842,993.67","2,266,050.67","3,459,979.67","2,125,379.33","744,638.33","3,799,740.25",...,3459979.67,2125379.33,744638.33,3799740.25,3783897.91,3255935.75,25634320.91,NaN,NaN,NaN
1,NaN,Stories Ain El Mreisseh,NaN,"12,648,546.67","9,929,973.33","9,849,926.67","13,025,923.33","7,208,975.00","2,883,403.33","11,889,329.16",...,13025923.33,7208975.00,2883403.33,11889329.16,11610097.92,11021123.75,90067299.16,NaN,NaN,NaN
2,NaN,Stories Airport,NaN,0.00,0.00,0.00,0.00,0.00,"8,428.83","2,940,003.01",...,0.00,0.00,8428.83,2940003.01,6963426.45,7467197.62,17379055.91,NaN,NaN,NaN
3,NaN,Stories Antelias,NaN,"2,615,854.33","2,139,010.67","3,162,716.67","3,391,741.33","2,033,635.67","728,978.33","2,963,696.71",...,3391741.33,2033635.67,728978.33,2963696.71,3182363.97,2909965.47,23127963.15,NaN,NaN,NaN
4,NaN,Stories Batroun,NaN,"4,266,517.33","3,388,117.33","4,890,198.33","5,516,881.67","2,963,980.33","1,311,240.00","6,135,003.02",...,5516881.67,2963980.33,1311240.00,6135003.02,6751770.29,5041150.76,40264859.06,NaN,NaN,NaN

In [59]:
def normalize_branch(s: str) -> str:
    s = str(s)
    s = s.replace("", "-").replace("", "-")
    s = " ".join(s.split())  # collapse spaces
    return s.strip()

clean_monthly["branch_norm"] = clean_monthly["branch"].apply(normalize_branch).str.lower()
clean_monthly[["branch","branch_norm"]].head(10)

                    branch              branch_norm
0      Stories - Bir Hasan      stories - bir hasan
1  Stories Ain El Mreisseh  stories ain el mreisseh
2          Stories Airport          stories airport
3         Stories Antelias         stories antelias
4          Stories Batroun          stories batroun
5           Stories Bayada           stories bayada
6      Stories Centro Mall      stories centro mall
7     Stories Event Starco     stories event starco
8            Stories Faqra            stories faqra
9          Stories Khaldeh          stories khaldeh

In [60]:
clean_monthly.shape
clean_monthly["year"].value_counts(dropna=False).sort_index()
clean_monthly["branch_norm"].nunique(), clean_monthly["branch"].nunique()
clean_monthly.isna().sum().sort_values(ascending=False).head(15)

13     102
12     102
oct    102
nov    102
dec    102
0       92
sep     90
11      90
jun     54
may     54
jul     54
apr     54
aug     54
6       52
9       52
dtype: int64

In [61]:
from pathlib import Path
OUT_DIR = Path("../outputs")
OUT_DIR.mkdir(exist_ok=True)

out1 = OUT_DIR / "clean_monthly_sales_file1.csv"
clean_monthly.to_csv(out1, index=False)
print("Saved:", out1.resolve())

Saved: C:\projects\stories-coffee-analytics\outputs\clean_monthly_sales_file1.csv

In [62]:
months = ["jan","feb","mar","apr","may","jun","jul","aug","sep","oct","nov","dec"]

keep_cols = ["year", "branch", "branch_norm"] + months + ["total_calc"]

clean_monthly = clean_monthly[keep_cols].copy()

clean_monthly.shape, clean_monthly.columns

((102, 16),
 Index(['year', 'branch', 'branch_norm', 'jan', 'feb', 'mar', 'apr', 'may',
        'jun', 'jul', 'aug', 'sep', 'oct', 'nov', 'dec', 'total_calc'],
       dtype='object'))

In [63]:
clean_monthly.isna().sum().sort_values(ascending=False).head(15)

dec            102
oct            102
nov            102
sep             90
apr             54
may             54
jul             54
aug             54
jun             54
jan              6
mar              6
feb              6
branch           0
year             0
branch_norm      0
dtype: int64

In [64]:
out1 = OUT_DIR / "clean_monthly_sales_file1.csv"
clean_monthly.to_csv(out1, index=False)
print("Saved:", out1.resolve())

Saved: C:\projects\stories-coffee-analytics\outputs\clean_monthly_sales_file1.csv